# By Jayant Awasthi

In [1]:
import pandas as pd
wrestler=pd.read_csv("wrestler.csv")

In [2]:
wrestler

            Name country  age  salary(in million)
0      John Cena     USA   43                  10
1      John Cena     USA   43                  10
2      John Cena     USA   43                  10
3     Undertaker     USA   55                   9
4     Undertaker     USA   55                   9
5     Undertaker     USA   55                   9
6        TripleH     USA   51                  12
7        TripleH     USA   51                  12
8   Brock Lesnor  Canada   43                   9
9      John Cena     USA   43                  10
10  Daniel Bryan     USA   39                   8
11         Asuka   Japan   39                   7
12         Asuka   Japan   39                   7
13     John Cena  Canada   43                  10
14    Undertaker     USA   54                   8

It is a csv file containing Name,Country,Age and Salary of Wrestlers

We can clearly see that {0,1,2},{3,4,5},{6,7},{11,12} contain Duplicate values

Index 13 John Cena is different from Index{0,1,2} John Cena they are different persons having same name,age,salary but different country

Index 14 Undertaker is different from Index{3,4,5}Undertaker they are different persons having same Name,Country but different age and Salary

In [3]:
def removeduplicate(wrestle):
    columnss=[]
    flag=0
    for i in wrestle.columns:
        columnss.append(i)
    index_of_duplicate=[]
    dictionary_of_duplicate={}
    total_number_of_column=len(columnss)
    for counter in range(len(wrestle)):
        for counter_m in range(len(wrestle)):
            for column in columnss:
                if counter==counter_m:
                    no_use_variable=0
                else:
                    if wrestle[column].iloc[counter]==wrestle[column].iloc[counter_m]:
                        flag=flag+1
                if flag==total_number_of_column:
                    if counter_m not in index_of_duplicate:
                        index_of_duplicate.append(counter_m)
                    if counter not in index_of_duplicate:
                        index_of_duplicate.append(counter)
                    index_of_duplicate.sort()
                    dictionary_of_duplicate[wrestle[columnss[0]].iloc[counter]]=index_of_duplicate
            flag=0
        index_of_duplicate=[]
    for col,inde in dictionary_of_duplicate.items():
        flag_a=1
        for ind in inde:
            if flag_a>1:
                wrestle.drop(ind,inplace=True)
            flag_a=flag_a+1
    wrestle.reset_index(drop=True,inplace=True)

I have created the above removeduplicate function to handle Duplicate Values in a dataframe

This is generalised function and it will work for any dataframe

to use the above function one have to just type:

removeduplicate(dataframename)

{{I made a little generalisation error earlier, now this commit is fine and generalised function is ready to work with every dataframe }}

Let try it on our wrestler dataframe

In [4]:
removeduplicate(wrestler)

In [5]:
wrestler

           Name country  age  salary(in million)
0     John Cena     USA   43                  10
1    Undertaker     USA   55                   9
2       TripleH     USA   51                  12
3  Brock Lesnor  Canada   43                   9
4  Daniel Bryan     USA   39                   8
5         Asuka   Japan   39                   7
6     John Cena  Canada   43                  10
7    Undertaker     USA   54                   8

We clearly see that the above function remove every duplicate values from dataframe

Index {0,7},{1,7} are different persons having same name